{"type":"data","nodes":[{"type":"data","data":[{"nodes":1},[2],{"url":3,"title":3,"children":4},"demo",[5,13],{"url":6,"title":7,"children":8},"demo/paul_graham","paul_graham",[9],{"url":10,"title":11,"children":12},"demo/paul_graham/great_work","great_work",[],{"url":14,"title":15,"children":16},"demo/reid_hoffman","reid_hoffman",[17],{"url":18,"title":19,"children":20},"demo/reid_hoffman/blitzscaling","blitzscaling",[21,25],{"url":22,"title":23,"children":24},"demo/reid_hoffman/blitzscaling/1.what_is_blitscaling","1.what_is_blitscaling",[],{"url":26,"title":27,"children":28},"demo/reid_hoffman/blitzscaling/2.business_model_innovation","2.business_model_innovation",[]],"uses":{}},{"type":"data","data":[{"content":1,"url":5},{"index":2,"half":3,"quarter":4},"Before you go anywhere else, let me tell you what the heck this whole thing is. This is an experiment I am doing to address a specific problem I have in mind.\n\nIf  I invited you here,  I think you enjoy reading because you think new concepts are interesting. Especially if they enhance your understanding of the world through some particular lens, perhaps business, science, or economics.\n\nMy problem with reading is that sometimes I go through a book, and I miss the points that the author is trying to make. So, I just read through the book paragraph by paragraph, and I suddenly realize, how the heck did the author get here. Some people call this “Reading with the eyes, and not the brain“.\n\nAuthors have the points they want to make in their mind, but they don’t always convey them explicitly. They try to elaborate, add details here and there. That is perhaps why I think it is easy to get lost. It is easy to read a book front to end, but get very little out of it.\n\nI think it is unfortunate that we could get a glimpse of the minds of brilliant people like **Nikola Tesla** (*My Inventions: The Autobiography of Nikola Tesla*), **Reid Hoffman** (*Blitzscaling: The Lightning-Fast Path to Building Massively Valuable Companies*), **Peter Thiel** (*Zero to One: Notes on Startups, or How to Build the Future*), **Daniel kahneman** (*Thinking, Fast and Slow*), but gain very little from that view.\n\nMy proposed solution is a tool where you can control how “summarized“ the content you are reading is. If you feel like you forget what is the context that got the author yapping about the small details that you are currently reading, you could pull a slider, and it will summarize the current paragraph, along with its relevant neighbors that are still talking about the same topic.\n\nSo, if you get lost in the small details, you have the power to “zoom out“ just a bit. If you are afraid of the cognitively impenetrable wall of text, you can zoom out as much as you want until you feel comfortable.\n\nMy solution is probably not perfect. It might even be addressing the problem in the wrong way. That is a valid concern. In fact, I think all the existing solutions are not addressing the problem properly. For instance, Blinkist. No matter how complex, how information dense the book is, it will shrink it down to 15 minutes. You are only presented with two options, either a summary that is way too basic, or a scary wall of text that goes through every small details.\n\nNow go to **demo** in the left sidebar. Sorry that this whole thing is just very scrappy. I feel somewhat embarrassed because it is so buggy, but heck, I’d rather be embarrassed now then spend a significant portion of time addressing things wrongly. So you should be critical about my approach. Saying that the problem is too hard and I should stop is not acceptable, but arguing  possibly better alternatives than what I have in mind, or how my idea could be improved are more than welcome.","Before you go anywhere else, let me tell you what this whole thing is. It’s an experiment I'm running to tackle a problem I face with reading. If I've invited you here, I believe you enjoy reading and find new concepts interesting, especially those that enhance your understanding of fields like business, science, or economics. My issue is that I sometimes read books and miss the key points the authors are making, often getting lost in the details they add. This phenomenon is sometimes called “Reading with the eyes, and not the brain.” Despite having the opportunity to glimpse the minds of brilliant individuals like Nikola Tesla, Reid Hoffman, Peter Thiel, and Daniel Kahneman, I often end up gaining very little from their works.\n\nMy proposed solution is a tool allowing you to control the degree of summarization of the content you're reading. If you lose track of the context amid the small details, a slider can summarize the current paragraph and its relevant neighbors, helping you \"zoom out\" a bit to reorient yourself. If faced with an overwhelming wall of text, you can zoom out as much as needed until you feel comfortable. While my solution might not be perfect and could be addressing the issue incorrectly, existing tools like Blinkist aren't solving the problem adequately either, as they overly condense content regardless of its complexity. Please check the demo in the left sidebar. Apologies for its scrappiness and bugs—I'd rather be embarrassed now than invest time in incorrect solutions. Criticism and improvements are welcome, but simply dismissing the problem as too difficult isn't helpful.","Before you go anywhere else, let me explain what this is. It’s an experiment I’m running to address a problem I face with reading. If you’re here, I believe you enjoy reading and exploring new concepts, especially in business, science, or economics. My problem is that I often miss the key points in books, getting lost in the details—a phenomenon I call “Reading with the eyes, and not the brain.” Despite reading works by brilliant minds like Tesla, Hoffman, Thiel, and Kahneman, I often gain little from them. My solution is a tool that allows you to control the degree of summarization of the content you're reading. If you get lost in details, a slider can help summarize the current paragraph and its context, letting you \"zoom out\" as needed. This approach, unlike existing tools like Blinkist, which overly condense content, aims to help you better reorient yourself. Please check the demo in the left sidebar. It’s scrappy and buggy, but I'd rather be embarrassed now than spend time on incorrect solutions. Criticism and suggestions for improvement are welcome, but dismissing the problem as too difficult isn’t helpful.\n",""],"uses":{}}]}
