{"type":"data","nodes":[{"type":"data","data":[{"nodes":1},[2],{"url":3,"title":3,"children":4},"demo",[5,13],{"url":6,"title":7,"children":8},"demo/paul_graham","paul_graham",[9],{"url":10,"title":11,"children":12},"demo/paul_graham/great_work","great_work",[],{"url":14,"title":15,"children":16},"demo/reid_hoffman","reid_hoffman",[17],{"url":18,"title":19,"children":20},"demo/reid_hoffman/blitzscaling","blitzscaling",[21,25],{"url":22,"title":23,"children":24},"demo/reid_hoffman/blitzscaling/1.what_is_blitscaling","1.what_is_blitscaling",[],{"url":26,"title":27,"children":28},"demo/reid_hoffman/blitzscaling/2.business_model_innovation","2.business_model_innovation",[]],"uses":{}},{"type":"data","data":[{"content":1,"url":5},{"index":2,"half":3,"quarter":4},"How to Do Great Work\n\nJuly 2023\n\nIf you collected lists of techniques for doing great work in a lot of different fields, what would the intersection look like? I decided to find out by making it.\n\nPartly my goal was to create a guide that could be used by someone working in any field. But I was also curious about the shape of the intersection. And one thing this exercise shows is that it does have a definite shape; it's not just a point labelled \"work hard.\"\n\nThe following recipe assumes you're very ambitious.\n\nThe first step is to decide what to work on. The work you choose needs to have three qualities: it has to be something you have a natural aptitude for, that you have a deep interest in, and that offers scope to do great work.\n\nIn practice you don't have to worry much about the third criterion. Ambitious people are if anything already too conservative about it. So all you need to do is find something you have an aptitude for and great interest in. [1]\n\nThat sounds straightforward, but it's often quite difficult. When you're young you don't know what you're good at or what different kinds of work are like. Some kinds of work you end up doing may not even exist yet. So while some people know what they want to do at 14, most have to figure it out.\n\nThe way to figure out what to work on is by working. If you're not sure what to work on, guess. But pick something and get going. You'll probably guess wrong some of the time, but that's fine. It's good to know about multiple things; some of the biggest discoveries come from noticing connections between different fields.\n\nDevelop a habit of working on your own projects. Don't let \"work\" mean something other people tell you to do. If you do manage to do great work one day, it will probably be on a project of your own. It may be within some bigger project, but you'll be driving your part of it.\n\nWhat should your projects be? Whatever seems to you excitingly ambitious. As you grow older and your taste in projects evolves, exciting and important will converge. At 7 it may seem excitingly ambitious to build huge things out of Lego, then at 14 to teach yourself calculus, till at 21 you're starting to explore unanswered questions in physics. But always preserve excitingness.\n\nThere's a kind of excited curiosity that's both the engine and the rudder of great work. It will not only drive you, but if you let it have its way, will also show you what to work on.\n\nWhat are you excessively curious about — curious to a degree that would bore most other people? That's what you're looking for.\n\nOnce you've found something you're excessively interested in, the next step is to learn enough about it to get you to one of the frontiers of knowledge. Knowledge expands fractally, and from a distance its edges look smooth, but once you learn enough to get close to one, they turn out to be full of gaps.\n\nThe next step is to notice them. This takes some skill, because your brain wants to ignore such gaps in order to make a simpler model of the world. Many discoveries have come from asking questions about things that everyone else took for granted. [2]\n\nIf the answers seem strange, so much the better. Great work often has a tincture of strangeness. You see this from painting to math. It would be affected to try to manufacture it, but if it appears, embrace it.\n\nBoldly chase outlier ideas, even if other people aren't interested in them — in fact, especially if they aren't. If you're excited about some possibility that everyone else ignores, and you have enough expertise to say precisely what they're all overlooking, that's as good a bet as you'll find. [3]\n\nFour steps: choose a field, learn enough to get to the frontier, notice gaps, explore promising ones. This is how practically everyone who's done great work has done it, from painters to physicists.\n\nSteps two and four will require hard work. It may not be possible to prove that you have to work hard to do great things, but the empirical evidence is on the scale of the evidence for mortality. That's why it's essential to work on something you're deeply interested in. Interest will drive you to work harder than mere diligence ever could.\n\nThe three most powerful motives are curiosity, delight, and the desire to do something impressive. Sometimes they converge, and that combination is the most powerful of all.\n\nThe big prize is to discover a new fractal bud. You notice a crack in the surface of knowledge, pry it open, and there's a whole world inside.\n\nLet's talk a little more about the complicated business of figuring out what to work on. The main reason it's hard is that you can't tell what most kinds of work are like except by doing them. Which means the four steps overlap: you may have to work at something for years before you know how much you like it or how good you are at it. And in the meantime you're not doing, and thus not learning about, most other kinds of work. So in the worst case you choose late based on very incomplete information. [4]\n\nThe nature of ambition exacerbates this problem. Ambition comes in two forms, one that precedes interest in the subject and one that grows out of it. Most people who do great work have a mix, and the more you have of the former, the harder it will be to decide what to do.\n\nThe educational systems in most countries pretend it's easy. They expect you to commit to a field long before you could know what it's really like. And as a result an ambitious person on an optimal trajectory will often read to the system as an instance of breakage.\n\nIt would be better if they at least admitted it — if they admitted that the system not only can't do much to help you figure out what to work on, but is designed on the assumption that you'll somehow magically guess as a teenager. They don't tell you, but I will: when it comes to figuring out what to work on, you're on your own. Some people get lucky and do guess correctly, but the rest will find themselves scrambling diagonally across tracks laid down on the assumption that everyone does.\n\nWhat should you do if you're young and ambitious but don't know what to work on? What you should not do is drift along passively, assuming the problem will solve itself. You need to take action. But there is no systematic procedure you can follow. When you read biographies of people who've done great work, it's remarkable how much luck is involved. They discover what to work on as a result of a chance meeting, or by reading a book they happen to pick up. So you need to make yourself a big target for luck, and the way to do that is to be curious. Try lots of things, meet lots of people, read lots of books, ask lots of questions. [5]\n\nWhen in doubt, optimize for interestingness. Fields change as you learn more about them. What mathematicians do, for example, is very different from what you do in high school math classes. So you need to give different types of work a chance to show you what they're like. But a field should become increasingly interesting as you learn more about it. If it doesn't, it's probably not for you.\n\nDon't worry if you find you're interested in different things than other people. The stranger your tastes in interestingness, the better. Strange tastes are often strong ones, and a strong taste for work means you'll be productive. And you're more likely to find new things if you're looking where few have looked before.\n\nOne sign that you're suited for some kind of work is when you like even the parts that other people find tedious or frightening.\n\nBut fields aren't people; you don't owe them any loyalty. If in the course of working on one thing you discover another that's more exciting, don't be afraid to switch.\n\nIf you're making something for people, make sure it's something they actually want. The best way to do this is to make something you yourself want. Write the story you want to read; build the tool you want to use. Since your friends probably have similar interests, this will also get you your initial audience.\n\nThis should follow from the excitingness rule. Obviously the most exciting story to write will be the one you want to read. The reason I mention this case explicitly is that so many people get it wrong. Instead of making what they want, they try to make what some imaginary, more sophisticated audience wants. And once you go down that route, you're lost. [6]\n\nThere are a lot of forces that will lead you astray when you're trying to figure out what to work on. Pretentiousness, fashion, fear, money, politics, other people's wishes, eminent frauds. But if you stick to what you find genuinely interesting, you'll be proof against all of them. If you're interested, you're not astray.\n\nFollowing your interests may sound like a rather passive strategy, but in practice it usually means following them past all sorts of obstacles. You usually have to risk rejection and failure. So it does take a good deal of boldness.\n\nBut while you need boldness, you don't usually need much planning. In most cases the recipe for doing great work is simply: work hard on excitingly ambitious projects, and something good will come of it. Instead of making a plan and then executing it, you just try to preserve certain invariants.\n\nThe trouble with planning is that it only works for achievements you can describe in advance. You can win a gold medal or get rich by deciding to as a child and then tenaciously pursuing that goal, but you can't discover natural selection that way.\n\nI think for most people who want to do great work, the right strategy is not to plan too much. At each stage do whatever seems most interesting and gives you the best options for the future. I call this approach \"staying upwind.\" This is how most people who've done great work seem to have done it.\n\nEven when you've found something exciting to work on, working on it is not always straightforward. There will be times when some new idea makes you leap out of bed in the morning and get straight to work. But there will also be plenty of times when things aren't like that.\n\nYou don't just put out your sail and get blown forward by inspiration. There are headwinds and currents and hidden shoals. So there's a technique to working, just as there is to sailing.\n\nFor example, while you must work hard, it's possible to work too hard, and if you do that you'll find you get diminishing returns: fatigue will make you stupid, and eventually even damage your health. The point at which work yields diminishing returns depends on the type. Some of the hardest types you might only be able to do for four or five hours a day.\n\nIdeally those hours will be contiguous. To the extent you can, try to arrange your life so you have big blocks of time to work in. You'll shy away from hard tasks if you know you might be interrupted.\n\nIt will probably be harder to start working than to keep working. You'll often have to trick yourself to get over that initial threshold. Don't worry about this; it's the nature of work, not a flaw in your character. Work has a sort of activation energy, both per day and per project. And since this threshold is fake in the sense that it's higher than the energy required to keep going, it's ok to tell yourself a lie of corresponding magnitude to get over it.\n\nIt's usually a mistake to lie to yourself if you want to do great work, but this is one of the rare cases where it isn't. When I'm reluctant to start work in the morning, I often trick myself by saying \"I'll just read over what I've got so far.\" Five minutes later I've found something that seems mistaken or incomplete, and I'm off.\n\nSimilar techniques work for starting new projects. It's ok to lie to yourself about how much work a project will entail, for example. Lots of great things began with someone saying \"How hard could it be?\"\n\nThis is one case where the young have an advantage. They're more optimistic, and even though one of the sources of their optimism is ignorance, in this case ignorance can sometimes beat knowledge.\n\nTry to finish what you start, though, even if it turns out to be more work than you expected. Finishing things is not just an exercise in tidiness or self-discipline. In many projects a lot of the best work happens in what was meant to be the final stage.\n\nAnother permissible lie is to exaggerate the importance of what you're working on, at least in your own mind. If that helps you discover something new, it may turn out not to have been a lie after all. [7]\n\nSince there are two senses of starting work — per day and per project — there are also two forms of procrastination. Per-project procrastination is far the more dangerous. You put off starting that ambitious project from year to year because the time isn't quite right. When you're procrastinating in units of years, you can get a lot not done. [8]\n\nOne reason per-project procrastination is so dangerous is that it usually camouflages itself as work. You're not just sitting around doing nothing; you're working industriously on something else. So per-project procrastination doesn't set off the alarms that per-day procrastination does. You're too busy to notice it.\n\nThe way to beat it is to stop occasionally and ask yourself: Am I working on what I most want to work on? When you're young it's ok if the answer is sometimes no, but this gets increasingly dangerous as you get older. [9]\n\nGreat work usually entails spending what would seem to most people an unreasonable amount of time on a problem. You can't think of this time as a cost, or it will seem too high. You have to find the work sufficiently engaging as it's happening.\n\nThere may be some jobs where you have to work diligently for years at things you hate before you get to the good part, but this is not how great work happens. Great work happens by focusing consistently on something you're genuinely interested in. When you pause to take stock, you're surprised how far you've come.\n\nThe reason we're surprised is that we underestimate the cumulative effect of work. Writing a page a day doesn't sound like much, but if you do it every day you'll write a book a year. That's the key: consistency. People who do great things don't get a lot done every day. They get something done, rather than nothing.\n\nIf you do work that compounds, you'll get exponential growth. Most people who do this do it unconsciously, but it's worth stopping to think about. Learning, for example, is an instance of this phenomenon: the more you learn about something, the easier it is to learn more. Growing an audience is another: the more fans you have, the more new fans they'll bring you.\n\nThe trouble with exponential growth is that the curve feels flat in the beginning. It isn't; it's still a wonderful exponential curve. But we can't grasp that intuitively, so we underrate exponential growth in its early stages.\n\nSomething that grows exponentially can become so valuable that it's worth making an extraordinary effort to get it started. But since we underrate exponential growth early on, this too is mostly done unconsciously: people push through the initial, unrewarding phase of learning something new because they know from experience that learning new things always takes an initial push, or they grow their audience one fan at a time because they have nothing better to do. If people consciously realized they could invest in exponential growth, many more would do it.\n\nWork doesn't just happen when you're trying to. There's a kind of undirected thinking you do when walking or taking a shower or lying in bed that can be very powerful. By letting your mind wander a little, you'll often solve problems you were unable to solve by frontal attack.\n\nYou have to be working hard in the normal way to benefit from this phenomenon, though. You can't just walk around daydreaming. The daydreaming has to be interleaved with deliberate work that feeds it questions. [10]\n\nEveryone knows to avoid distractions at work, but it's also important to avoid them in the other half of the cycle. When you let your mind wander, it wanders to whatever you care about most at that moment. So avoid the kind of distraction that pushes your work out of the top spot, or you'll waste this valuable type of thinking on the distraction instead. (Exception: Don't avoid love.)\n\nConsciously cultivate your taste in the work done in your field. Until you know which is the best and what makes it so, you don't know what you're aiming for.\n\nAnd that is what you're aiming for, because if you don't try to be the best, you won't even be good. This observation has been made by so many people in so many different fields that it might be worth thinking about why it's true. It could be because ambition is a phenomenon where almost all the error is in one direction — where almost all the shells that miss the target miss by falling short. Or it could be because ambition to be the best is a qualitatively different thing from ambition to be good. Or maybe being good is simply too vague a standard. Probably all three are true. [11]\n\nFortunately there's a kind of economy of scale here. Though it might seem like you'd be taking on a heavy burden by trying to be the best, in practice you often end up net ahead. It's exciting, and also strangely liberating. It simplifies things. In some ways it's easier to try to be the best than to try merely to be good.\n\nOne way to aim high is to try to make something that people will care about in a hundred years. Not because their opinions matter more than your contemporaries', but because something that still seems good in a hundred years is more likely to be genuinely good.\n\nDon't try to work in a distinctive style. Just try to do the best job you can; you won't be able to help doing it in a distinctive way.\n\nStyle is doing things in a distinctive way without trying to. Trying to is affectation.\n\nAffectation is in effect to pretend that someone other than you is doing the work. You adopt an impressive but fake persona, and while you're pleased with the impressiveness, the fakeness is what shows in the work. [12]\n\nThe temptation to be someone else is greatest for the young. They often feel like nobodies. But you never need to worry about that problem, because it's self-solving if you work on sufficiently ambitious projects. If you succeed at an ambitious project, you're not a nobody; you're the person who did it. So just do the work and your identity will take care of itself.\n\n\"Avoid affectation\" is a useful rule so far as it goes, but how would you express this idea positively? How would you say what to be, instead of what not to be? The best answer is earnest. If you're earnest you avoid not just affectation but a whole set of similar vices.\n\nThe core of being earnest is being intellectually honest. We're taught as children to be honest as an unselfish virtue — as a kind of sacrifice. But in fact it's a source of power too. To see new ideas, you need an exceptionally sharp eye for the truth. You're trying to see more truth than others have seen so far. And how can you have a sharp eye for the truth if you're intellectually dishonest?\n\nOne way to avoid intellectual dishonesty is to maintain a slight positive pressure in the opposite direction. Be aggressively willing to admit that you're mistaken. Once you've admitted you were mistaken about something, you're free. Till then you have to carry it. [13]\n\nAnother more subtle component of earnestness is informality. Informality is much more important than its grammatically negative name implies. It's not merely the absence of something. It means focusing on what matters instead of what doesn't.\n\nWhat formality and affectation have in common is that as well as doing the work, you're trying to seem a certain way as you're doing it. But any energy that goes into how you seem comes out of being good. That's one reason nerds have an advantage in doing great work: they expend little effort on seeming anything. In fact that's basically the definition of a nerd.\n\nNerds have a kind of innocent boldness that's exactly what you need in doing great work. It's not learned; it's preserved from childhood. So hold onto it. Be the one who puts things out there rather than the one who sits back and offers sophisticated-sounding criticisms of them. \"It's easy to criticize\" is true in the most literal sense, and the route to great work is never easy.\n\nThere may be some jobs where it's an advantage to be cynical and pessimistic, but if you want to do great work it's an advantage to be optimistic, even though that means you'll risk looking like a fool sometimes. There's an old tradition of doing the opposite. The Old Testament says it's better to keep quiet lest you look like a fool. But that's advice for seeming smart. If you actually want to discover new things, it's better to take the risk of telling people your ideas.\n\nSome people are naturally earnest, and with others it takes a conscious effort. Either kind of earnestness will suffice. But I doubt it would be possible to do great work without being earnest. It's so hard to do even if you are. You don't have enough margin for error to accommodate the distortions introduced by being affected, intellectually dishonest, orthodox, fashionable, or cool. [14]\n\nGreat work is consistent not only with who did it, but with itself. It's usually all of a piece. So if you face a decision in the middle of working on something, ask which choice is more consistent.\n\nYou may have to throw things away and redo them. You won't necessarily have to, but you have to be willing to. And that can take some effort; when there's something you need to redo, status quo bias and laziness will combine to keep you in denial about it. To beat this ask: If I'd already made the change, would I want to revert to what I have now?\n\nHave the confidence to cut. Don't keep something that doesn't fit just because you're proud of it, or because it cost you a lot of effort.\n\nIndeed, in some kinds of work it's good to strip whatever you're doing to its essence. The result will be more concentrated; you'll understand it better; and you won't be able to lie to yourself about whether there's anything real there.\n\nMathematical elegance may sound like a mere metaphor, drawn from the arts. That's what I thought when I first heard the term \"elegant\" applied to a proof. But now I suspect it's conceptually prior — that the main ingredient in artistic elegance is mathematical elegance. At any rate it's a useful standard well beyond math.\n\nElegance can be a long-term bet, though. Laborious solutions will often have more prestige in the short term. They cost a lot of effort and they're hard to understand, both of which impress people, at least temporarily.\n\nWhereas some of the very best work will seem like it took comparatively little effort, because it was in a sense already there. It didn't have to be built, just seen. It's a very good sign when it's hard to say whether you're creating something or discovering it.\n\nWhen you're doing work that could be seen as either creation or discovery, err on the side of discovery. Try thinking of yourself as a mere conduit through which the ideas take their natural shape.\n\n(Strangely enough, one exception is the problem of choosing a problem to work on. This is usually seen as search, but in the best case it's more like creating something. In the best case you create the field in the process of exploring it.)\n\nSimilarly, if you're trying to build a powerful tool, make it gratuitously unrestrictive. A powerful tool almost by definition will be used in ways you didn't expect, so err on the side of eliminating restrictions, even if you don't know what the benefit will be.\n\nGreat work will often be tool-like in the sense of being something others build on. So it's a good sign if you're creating ideas that others could use, or exposing questions that others could answer. The best ideas have implications in many different areas.\n\nIf you express your ideas in the most general form, they'll be truer than you intended.\n\nTrue by itself is not enough, of course. Great ideas have to be true and new. And it takes a certain amount of ability to see new ideas even once you've learned enough to get to one of the frontiers of knowledge.\n\nIn English we give this ability names like originality, creativity, and imagination. And it seems reasonable to give it a separate name, because it does seem to some extent a separate skill. It's possible to have a great deal of ability in other respects — to have a great deal of what's often called \"technical ability\" — and yet not have much of this.\n\nI've never liked the term \"creative process.\" It seems misleading. Originality isn't a process, but a habit of mind. Original thinkers throw off new ideas about whatever they focus on, like an angle grinder throwing off sparks. They can't help it.\n\nIf the thing they're focused on is something they don't understand very well, these new ideas might not be good. One of the most original thinkers I know decided to focus on dating after he got divorced. He knew roughly as much about dating as the average 15 year old, and the results were spectacularly colorful. But to see originality separated from expertise like that made its nature all the more clear.\n\nI don't know if it's possible to cultivate originality, but there are definitely ways to make the most of however much you have. For example, you're much more likely to have original ideas when you're working on something. Original ideas don't come from trying to have original ideas. They come from trying to build or understand something slightly too difficult. [15]\n\nTalking or writing about the things you're interested in is a good way to generate new ideas. When you try to put ideas into words, a missing idea creates a sort of vacuum that draws it out of you. Indeed, there's a kind of thinking that can only be done by writing.\n\nChanging your context can help. If you visit a new place, you'll often find you have new ideas there. The journey itself often dislodges them. But you may not have to go far to get this benefit. Sometimes it's enough just to go for a walk. [16]\n\nIt also helps to travel in topic space. You'll have more new ideas if you explore lots of different topics, partly because it gives the angle grinder more surface area to work on, and partly because analogies are an especially fruitful source of new ideas.\n\nDon't divide your attention evenly between many topics though, or you'll spread yourself too thin. You want to distribute it according to something more like a power law. [17] Be professionally curious about a few topics and idly curious about many more.\n\nCuriosity and originality are closely related. Curiosity feeds originality by giving it new things to work on. But the relationship is closer than that. Curiosity is itself a kind of originality; it's roughly to questions what originality is to answers. And since questions at their best are a big component of answers, curiosity at its best is a creative force.\n\nHaving new ideas is a strange game, because it usually consists of seeing things that were right under your nose. Once you've seen a new idea, it tends to seem obvious. Why did no one think of this before?\n\nWhen an idea seems simultaneously novel and obvious, it's probably a good one.\n\nSeeing something obvious sounds easy. And yet empirically having new ideas is hard. What's the source of this apparent contradiction? It's that seeing the new idea usually requires you to change the way you look at the world. We see the world through models that both help and constrain us. When you fix a broken model, new ideas become obvious. But noticing and fixing a broken model is hard. That's how new ideas can be both obvious and yet hard to discover: they're easy to see after you do something hard.\n\nOne way to discover broken models is to be stricter than other people. Broken models of the world leave a trail of clues where they bash against reality. Most people don't want to see these clues. It would be an understatement to say that they're attached to their current model; it's what they think in; so they'll tend to ignore the trail of clues left by its breakage, however conspicuous it may seem in retrospect.\n\nTo find new ideas you have to seize on signs of breakage instead of looking away. That's what Einstein did. He was able to see the wild implications of Maxwell's equations not so much because he was looking for new ideas as because he was stricter.\n\nThe other thing you need is a willingness to break rules. Paradoxical as it sounds, if you want to fix your model of the world, it helps to be the sort of person who's comfortable breaking rules. From the point of view of the old model, which everyone including you initially shares, the new model usually breaks at least implicit rules.\n\nFew understand the degree of rule-breaking required, because new ideas seem much more conservative once they succeed. They seem perfectly reasonable once you're using the new model of the world they brought with them. But they didn't at the time; it took the greater part of a century for the heliocentric model to be generally accepted, even among astronomers, because it felt so wrong.\n\nIndeed, if you think about it, a good new idea has to seem bad to most people, or someone would have already explored it. So what you're looking for is ideas that seem crazy, but the right kind of crazy. How do you recognize these? You can't with certainty. Often ideas that seem bad are bad. But ideas that are the right kind of crazy tend to be exciting; they're rich in implications; whereas ideas that are merely bad tend to be depressing.\n\nThere are two ways to be comfortable breaking rules: to enjoy breaking them, and to be indifferent to them. I call these two cases being aggressively and passively independent-minded.\n\nThe aggressively independent-minded are the naughty ones. Rules don't merely fail to stop them; breaking rules gives them additional energy. For this sort of person, delight at the sheer audacity of a project sometimes supplies enough activation energy to get it started.\n\nThe other way to break rules is not to care about them, or perhaps even to know they exist. This is why novices and outsiders often make new discoveries; their ignorance of a field's assumptions acts as a source of temporary passive independent-mindedness. Aspies also seem to have a kind of immunity to conventional beliefs. Several I know say that this helps them to have new ideas.\n\nStrictness plus rule-breaking sounds like a strange combination. In popular culture they're opposed. But popular culture has a broken model in this respect. It implicitly assumes that issues are trivial ones, and in trivial matters strictness and rule-breaking are opposed. But in questions that really matter, only rule-breakers can be truly strict.\n\nAn overlooked idea often doesn't lose till the semifinals. You do see it, subconsciously, but then another part of your subconscious shoots it down because it would be too weird, too risky, too much work, too controversial. This suggests an exciting possibility: if you could turn off such filters, you could see more new ideas.\n\nOne way to do that is to ask what would be good ideas for someone else to explore. Then your subconscious won't shoot them down to protect you.\n\nYou could also discover overlooked ideas by working in the other direction: by starting from what's obscuring them. Every cherished but mistaken principle is surrounded by a dead zone of valuable ideas that are unexplored because they contradict it.\n\nReligions are collections of cherished but mistaken principles. So anything that can be described either literally or metaphorically as a religion will have valuable unexplored ideas in its shadow. Copernicus and Darwin both made discoveries of this type. [18]\n\nWhat are people in your field religious about, in the sense of being too attached to some principle that might not be as self-evident as they think? What becomes possible if you discard it?\n\nPeople show much more originality in solving problems than in deciding which problems to solve. Even the smartest can be surprisingly conservative when deciding what to work on. People who'd never dream of being fashionable in any other way get sucked into working on fashionable problems.\n\nOne reason people are more conservative when choosing problems than solutions is that problems are bigger bets. A problem could occupy you for years, while exploring a solution might only take days. But even so I think most people are too conservative. They're not merely responding to risk, but to fashion as well. Unfashionable problems are undervalued.\n\nOne of the most interesting kinds of unfashionable problem is the problem that people think has been fully explored, but hasn't. Great work often takes something that already exists and shows its latent potential. Durer and Watt both did this. So if you're interested in a field that others think is tapped out, don't let their skepticism deter you. People are often wrong about this.\n\nWorking on an unfashionable problem can be very pleasing. There's no hype or hurry. Opportunists and critics are both occupied elsewhere. The existing work often has an old-school solidity. And there's a satisfying sense of economy in cultivating ideas that would otherwise be wasted.\n\nBut the most common type of overlooked problem is not explicitly unfashionable in the sense of being out of fashion. It just doesn't seem to matter as much as it actually does. How do you find these? By being self-indulgent — by letting your curiosity have its way, and tuning out, at least temporarily, the little voice in your head that says you should only be working on \"important\" problems.\n\nYou do need to work on important problems, but almost everyone is too conservative about what counts as one. And if there's an important but overlooked problem in your neighborhood, it's probably already on your subconscious radar screen. So try asking yourself: if you were going to take a break from \"serious\" work to work on something just because it would be really interesting, what would you do? The answer is probably more important than it seems.\n\nOriginality in choosing problems seems to matter even more than originality in solving them. That's what distinguishes the people who discover whole new fields. So what might seem to be merely the initial step — deciding what to work on — is in a sense the key to the whole game.\n\nFew grasp this. One of the biggest misconceptions about new ideas is about the ratio of question to answer in their composition. People think big ideas are answers, but often the real insight was in the question.\n\nPart of the reason we underrate questions is the way they're used in schools. In schools they tend to exist only briefly before being answered, like unstable particles. But a really good question can be much more than that. A really good question is a partial discovery. How do new species arise? Is the force that makes objects fall to earth the same as the one that keeps planets in their orbits? By even asking such questions you were already in excitingly novel territory.\n\nUnanswered questions can be uncomfortable things to carry around with you. But the more you're carrying, the greater the chance of noticing a solution — or perhaps even more excitingly, noticing that two unanswered questions are the same.\n\nSometimes you carry a question for a long time. Great work often comes from returning to a question you first noticed years before — in your childhood, even — and couldn't stop thinking about. People talk a lot about the importance of keeping your youthful dreams alive, but it's just as important to keep your youthful questions alive. [19]\n\nThis is one of the places where actual expertise differs most from the popular picture of it. In the popular picture, experts are certain. But actually the more puzzled you are, the better, so long as (a) the things you're puzzled about matter, and (b) no one else understands them either.\n\nThink about what's happening at the moment just before a new idea is discovered. Often someone with sufficient expertise is puzzled about something. Which means that originality consists partly of puzzlement — of confusion! You have to be comfortable enough with the world being full of puzzles that you're willing to see them, but not so comfortable that you don't want to solve them. [20]\n\nIt's a great thing to be rich in unanswered questions. And this is one of those situations where the rich get richer, because the best way to acquire new questions is to try answering existing ones. Questions don't just lead to answers, but also to more questions.\n\nThe best questions grow in the answering. You notice a thread protruding from the current paradigm and try pulling on it, and it just gets longer and longer. So don't require a question to be obviously big before you try answering it. You can rarely predict that. It's hard enough even to notice the thread, let alone to predict how much will unravel if you pull on it.\n\nIt's better to be promiscuously curious — to pull a little bit on a lot of threads, and see what happens. Big things start small. The initial versions of big things were often just experiments, or side projects, or talks, which then grew into something bigger. So start lots of small things.\n\nBeing prolific is underrated. The more different things you try, the greater the chance of discovering something new. Understand, though, that trying lots of things will mean trying lots of things that don't work. You can't have a lot of good ideas without also having a lot of bad ones. [21]\n\nThough it sounds more responsible to begin by studying everything that's been done before, you'll learn faster and have more fun by trying stuff. And you'll understand previous work better when you do look at it. So err on the side of starting. Which is easier when starting means starting small; those two ideas fit together like two puzzle pieces.\n\nHow do you get from starting small to doing something great? By making successive versions. Great things are almost always made in successive versions. You start with something small and evolve it, and the final version is both cleverer and more ambitious than anything you could have planned.\n\nIt's particularly useful to make successive versions when you're making something for people — to get an initial version in front of them quickly, and then evolve it based on their response.\n\nBegin by trying the simplest thing that could possibly work. Surprisingly often, it does. If it doesn't, this will at least get you started.\n\nDon't try to cram too much new stuff into any one version. There are names for doing this with the first version (taking too long to ship) and the second (the second system effect), but these are both merely instances of a more general principle.\n\nAn early version of a new project will sometimes be dismissed as a toy. It's a good sign when people do this. That means it has everything a new idea needs except scale, and that tends to follow. [22]\n\nThe alternative to starting with something small and evolving it is to plan in advance what you're going to do. And planning does usually seem the more responsible choice. It sounds more organized to say \"we're going to do x and then y and then z\" than \"we're going to try x and see what happens.\" And it is more organized; it just doesn't work as well.\n\nPlanning per se isn't good. It's sometimes necessary, but it's a necessary evil — a response to unforgiving conditions. It's something you have to do because you're working with inflexible media, or because you need to coordinate the efforts of a lot of people. If you keep projects small and use flexible media, you don't have to plan as much, and your designs can evolve instead.\n\nTake as much risk as you can afford. In an efficient market, risk is proportionate to reward, so don't look for certainty, but for a bet with high expected value. If you're not failing occasionally, you're probably being too conservative.\n\nThough conservatism is usually associated with the old, it's the young who tend to make this mistake. Inexperience makes them fear risk, but it's when you're young that you can afford the most.\n\nEven a project that fails can be valuable. In the process of working on it, you'll have crossed territory few others have seen, and encountered questions few others have asked. And there's probably no better source of questions than the ones you encounter in trying to do something slightly too hard.\n\nUse the advantages of youth when you have them, and the advantages of age once you have those. The advantages of youth are energy, time, optimism, and freedom. The advantages of age are knowledge, efficiency, money, and power. With effort you can acquire some of the latter when young and keep some of the former when old.\n\nThe old also have the advantage of knowing which advantages they have. The young often have them without realizing it. The biggest is probably time. The young have no idea how rich they are in time. The best way to turn this time to advantage is to use it in slightly frivolous ways: to learn about something you don't need to know about, just out of curiosity, or to try building something just because it would be cool, or to become freakishly good at something.\n\nThat \"slightly\" is an important qualification. Spend time lavishly when you're young, but don't simply waste it. There's a big difference between doing something you worry might be a waste of time and doing something you know for sure will be. The former is at least a bet, and possibly a better one than you think. [23]\n\nThe most subtle advantage of youth, or more precisely of inexperience, is that you're seeing everything with fresh eyes. When your brain embraces an idea for the first time, sometimes the two don't fit together perfectly. Usually the problem is with your brain, but occasionally it's with the idea. A piece of it sticks out awkwardly and jabs you when you think about it. People who are used to the idea have learned to ignore it, but you have the opportunity not to. [24]\n\nSo when you're learning about something for the first time, pay attention to things that seem wrong or missing. You'll be tempted to ignore them, since there's a 99% chance the problem is with you. And you may have to set aside your misgivings temporarily to keep progressing. But don't forget about them. When you've gotten further into the subject, come back and check if they're still there. If they're still viable in the light of your present knowledge, they probably represent an undiscovered idea.\n\nOne of the most valuable kinds of knowledge you get from experience is to know what you don't have to worry about. The young know all the things that could matter, but not their relative importance. So they worry equally about everything, when they should worry much more about a few things and hardly at all about the rest.\n\nBut what you don't know is only half the problem with inexperience. The other half is what you do know that ain't so. You arrive at adulthood with your head full of nonsense — bad habits you've acquired and false things you've been taught — and you won't be able to do great work till you clear away at least the nonsense in the way of whatever type of work you want to do.\n\nMuch of the nonsense left in your head is left there by schools. We're so used to schools that we unconsciously treat going to school as identical with learning, but in fact schools have all sorts of strange qualities that warp our ideas about learning and thinking.\n\nFor example, schools induce passivity. Since you were a small child, there was an authority at the front of the class telling all of you what you had to learn and then measuring whether you did. But neither classes nor tests are intrinsic to learning; they're just artifacts of the way schools are usually designed.\n\nThe sooner you overcome this passivity, the better. If you're still in school, try thinking of your education as your project, and your teachers as working for you rather than vice versa. That may seem a stretch, but it's not merely some weird thought experiment. It's the truth, economically, and in the best case it's the truth intellectually as well. The best teachers don't want to be your bosses. They'd prefer it if you pushed ahead, using them as a source of advice, rather than being pulled by them through the material.\n\nSchools also give you a misleading impression of what work is like. In school they tell you what the problems are, and they're almost always soluble using no more than you've been taught so far. In real life you have to figure out what the problems are, and you often don't know if they're soluble at all.\n\nBut perhaps the worst thing schools do to you is train you to win by hacking the test. You can't do great work by doing that. You can't trick God. So stop looking for that kind of shortcut. The way to beat the system is to focus on problems and solutions that others have overlooked, not to skimp on the work itself.\n\nDon't think of yourself as dependent on some gatekeeper giving you a \"big break.\" Even if this were true, the best way to get it would be to focus on doing good work rather than chasing influential people.\n\nAnd don't take rejection by committees to heart. The qualities that impress admissions officers and prize committees are quite different from those required to do great work. The decisions of selection committees are only meaningful to the extent that they're part of a feedback loop, and very few are.\n\nPeople new to a field will often copy existing work. There's nothing inherently bad about that. There's no better way to learn how something works than by trying to reproduce it. Nor does copying necessarily make your work unoriginal. Originality is the presence of new ideas, not the absence of old ones.\n\nThere's a good way to copy and a bad way. If you're going to copy something, do it openly instead of furtively, or worse still, unconsciously. This is what's meant by the famously misattributed phrase \"Great artists steal.\" The really dangerous kind of copying, the kind that gives copying a bad name, is the kind that's done without realizing it, because you're nothing more than a train running on tracks laid down by someone else. But at the other extreme, copying can be a sign of superiority rather than subordination. [25]\n\nIn many fields it's almost inevitable that your early work will be in some sense based on other people's. Projects rarely arise in a vacuum. They're usually a reaction to previous work. When you're first starting out, you don't have any previous work; if you're going to react to something, it has to be someone else's. Once you're established, you can react to your own. But while the former gets called derivative and the latter doesn't, structurally the two cases are more similar than they seem.\n\nOddly enough, the very novelty of the most novel ideas sometimes makes them seem at first to be more derivative than they are. New discoveries often have to be conceived initially as variations of existing things, even by their discoverers, because there isn't yet the conceptual vocabulary to express them.\n\nThere are definitely some dangers to copying, though. One is that you'll tend to copy old things — things that were in their day at the frontier of knowledge, but no longer are.\n\nAnd when you do copy something, don't copy every feature of it. Some will make you ridiculous if you do. Don't copy the manner of an eminent 50 year old professor if you're 18, for example, or the idiom of a Renaissance poem hundreds of years later.\n\nSome of the features of things you admire are flaws they succeeded despite. Indeed, the features that are easiest to imitate are the most likely to be the flaws.\n\nThis is particularly true for behavior. Some talented people are jerks, and this sometimes makes it seem to the inexperienced that being a jerk is part of being talented. It isn't; being talented is merely how they get away with it.\n\nOne of the most powerful kinds of copying is to copy something from one field into another. History is so full of chance discoveries of this type that it's probably worth giving chance a hand by deliberately learning about other kinds of work. You can take ideas from quite distant fields if you let them be metaphors.\n\nNegative examples can be as inspiring as positive ones. In fact you can sometimes learn more from things done badly than from things done well; sometimes it only becomes clear what's needed when it's missing.\n\nIf a lot of the best people in your field are collected in one place, it's usually a good idea to visit for a while. It will increase your ambition, and also, by showing you that these people are human, increase your self-confidence. [26]\n\nIf you're earnest you'll probably get a warmer welcome than you might expect. Most people who are very good at something are happy to talk about it with anyone who's genuinely interested. If they're really good at their work, then they probably have a hobbyist's interest in it, and hobbyists always want to talk about their hobbies.\n\nIt may take some effort to find the people who are really good, though. Doing great work has such prestige that in some places, particularly universities, there's a polite fiction that everyone is engaged in it. And that is far from true. People within universities can't say so openly, but the quality of the work being done in different departments varies immensely. Some departments have people doing great work; others have in the past; others never have.\n\nSeek out the best colleagues. There are a lot of projects that can't be done alone, and even if you're working on one that can be, it's good to have other people to encourage you and to bounce ideas off.\n\nColleagues don't just affect your work, though; they also affect you. So work with people you want to become like, because you will.\n\nQuality is more important than quantity in colleagues. It's better to have one or two great ones than a building full of pretty good ones. In fact it's not merely better, but necessary, judging from history: the degree to which great work happens in clusters suggests that one's colleagues often make the difference between doing great work and not.\n\nHow do you know when you have sufficiently good colleagues? In my experience, when you do, you know. Which means if you're unsure, you probably don't. But it may be possible to give a more concrete answer than that. Here's an attempt: sufficiently good colleagues offer surprising insights. They can see and do things that you can't. So if you have a handful of colleagues good enough to keep you on your toes in this sense, you're probably over the threshold.\n\nMost of us can benefit from collaborating with colleagues, but some projects require people on a larger scale, and starting one of those is not for everyone. If you want to run a project like that, you'll have to become a manager, and managing well takes aptitude and interest like any other kind of work. If you don't have them, there is no middle path: you must either force yourself to learn management as a second language, or avoid such projects. [27]\n\nHusband your morale. It's the basis of everything when you're working on ambitious projects. You have to nurture and protect it like a living organism.\n\nMorale starts with your view of life. You're more likely to do great work if you're an optimist, and more likely to if you think of yourself as lucky than if you think of yourself as a victim.\n\nIndeed, work can to some extent protect you from your problems. If you choose work that's pure, its very difficulties will serve as a refuge from the difficulties of everyday life. If this is escapism, it's a very productive form of it, and one that has been used by some of the greatest minds in history.\n\nMorale compounds via work: high morale helps you do good work, which increases your morale and helps you do even better work. But this cycle also operates in the other direction: if you're not doing good work, that can demoralize you and make it even harder to. Since it matters so much for this cycle to be running in the right direction, it can be a good idea to switch to easier work when you're stuck, just so you start to get something done.\n\nOne of the biggest mistakes ambitious people make is to allow setbacks to destroy their morale all at once, like a balloon bursting. You can inoculate yourself against this by explicitly considering setbacks a part of your process. Solving hard problems always involves some backtracking.\n\nDoing great work is a depth-first search whose root node is the desire to. So \"If at first you don't succeed, try, try again\" isn't quite right. It should be: If at first you don't succeed, either try again, or backtrack and then try again.\n\n\"Never give up\" is also not quite right. Obviously there are times when it's the right choice to eject. A more precise version would be: Never let setbacks panic you into backtracking more than you need to. Corollary: Never abandon the root node.\n\nIt's not necessarily a bad sign if work is a struggle, any more than it's a bad sign to be out of breath while running. It depends how fast you're running. So learn to distinguish good pain from bad. Good pain is a sign of effort; bad pain is a sign of damage.\n\nAn audience is a critical component of morale. If you're a scholar, your audience may be your peers; in the arts, it may be an audience in the traditional sense. Either way it doesn't need to be big. The value of an audience doesn't grow anything like linearly with its size. Which is bad news if you're famous, but good news if you're just starting out, because it means a small but dedicated audience can be enough to sustain you. If a handful of people genuinely love what you're doing, that's enough.\n\nTo the extent you can, avoid letting intermediaries come between you and your audience. In some types of work this is inevitable, but it's so liberating to escape it that you might be better off switching to an adjacent type if that will let you go direct. [28]\n\nThe people you spend time with will also have a big effect on your morale. You'll find there are some who increase your energy and others who decrease it, and the effect someone has is not always what you'd expect. Seek out the people who increase your energy and avoid those who decrease it. Though of course if there's someone you need to take care of, that takes precedence.\n\nDon't marry someone who doesn't understand that you need to work, or sees your work as competition for your attention. If you're ambitious, you need to work; it's almost like a medical condition; so someone who won't let you work either doesn't understand you, or does and doesn't care.\n\nUltimately morale is physical. You think with your body, so it's important to take care of it. That means exercising regularly, eating and sleeping well, and avoiding the more dangerous kinds of drugs. Running and walking are particularly good forms of exercise because they're good for thinking. [29]\n\nPeople who do great work are not necessarily happier than everyone else, but they're happier than they'd be if they didn't. In fact, if you're smart and ambitious, it's dangerous not to be productive. People who are smart and ambitious but don't achieve much tend to become bitter.\n\nIt's ok to want to impress other people, but choose the right people. The opinion of people you respect is signal. Fame, which is the opinion of a much larger group you might or might not respect, just adds noise.\n\nThe prestige of a type of work is at best a trailing indicator and sometimes completely mistaken. If you do anything well enough, you'll make it prestigious. So the question to ask about a type of work is not how much prestige it has, but how well it could be done.\n\nCompetition can be an effective motivator, but don't let it choose the problem for you; don't let yourself get drawn into chasing something just because others are. In fact, don't let competitors make you do anything much more specific than work harder.\n\nCuriosity is the best guide. Your curiosity never lies, and it knows more than you do about what's worth paying attention to.\n\nNotice how often that word has come up. If you asked an oracle the secret to doing great work and the oracle replied with a single word, my bet would be on \"curiosity.\"\n\nThat doesn't translate directly to advice. It's not enough just to be curious, and you can't command curiosity anyway. But you can nurture it and let it drive you.\n\nCuriosity is the key to all four steps in doing great work: it will choose the field for you, get you to the frontier, cause you to notice the gaps in it, and drive you to explore them. The whole process is a kind of dance with curiosity.\n\nBelieve it or not, I tried to make this essay as short as I could. But its length at least means it acts as a filter. If you made it this far, you must be interested in doing great work. And if so you're already further along than you might realize, because the set of people willing to want to is small.\n\nThe factors in doing great work are factors in the literal, mathematical sense, and they are: ability, interest, effort, and luck. Luck by definition you can't do anything about, so we can ignore that. And we can assume effort, if you do in fact want to do great work. So the problem boils down to ability and interest. Can you find a kind of work where your ability and interest will combine to yield an explosion of new ideas?\n\nHere there are grounds for optimism. There are so many different ways to do great work, and even more that are still undiscovered. Out of all those different types of work, the one you're most suited for is probably a pretty close match. Probably a comically close match. It's just a question of finding it, and how far into it your ability and interest can take you. And you can only answer that by trying.\n\nMany more people could try to do great work than do. What holds them back is a combination of modesty and fear. It seems presumptuous to try to be Newton or Shakespeare. It also seems hard; surely if you tried something like that, you'd fail. Presumably the calculation is rarely explicit. Few people consciously decide not to try to do great work. But that's what's going on subconsciously; they shy away from the question.\n\nSo I'm going to pull a sneaky trick on you. Do you want to do great work, or not? Now you have to decide consciously. Sorry about that. I wouldn't have done it to a general audience. But we already know you're interested.\n\nDon't worry about being presumptuous. You don't have to tell anyone. And if it's too hard and you fail, so what? Lots of people have worse problems than that. In fact you'll be lucky if it's the worst problem you have.\n\nYes, you'll have to work hard. But again, lots of people have to work hard. And if you're working on something you find very interesting, which you necessarily will if you're on the right path, the work will probably feel less burdensome than a lot of your peers'.\n\nThe discoveries are out there, waiting to be made. Why not by you?","If you gathered techniques for doing great work across various fields, what would their commonalities look like? Driven by this curiosity, I decided to create such a guide, usable by anyone, regardless of their field. Through this exercise, I discovered that these common strategies indeed form a definite structure rather than just a vague notion like \"work hard.\" This recipe for great work starts with the assumption that you're highly ambitious. The first step is choosing what to work on. Your chosen work must have three essential traits: it should align with your natural talents, deeply interest you, and provide ample opportunity to produce outstanding work.\n\nYou don't need to stress much about determining the third criterion of work. Ambitious individuals are often already quite cautious about this. Instead, focus on finding something you have both an aptitude for and a great interest in, which can be challenging. When you're young, you're unaware of your true strengths or the nature of various careers, particularly those that don't yet exist. While some people have clear ambitions early on, most need to figure it out through experience. If undecided, simply guess and start working on something; trial and error is fine and will help you understand various fields. Cultivate a habit of pursuing your own projects, as the most significant work you'll do will likely be driven by your own ambitions. Your projects should be whatever excites you most. Over time, what's exciting and what’s important will converge, evolving from simple interests to more complex inquiries. Preserve your enthusiasm and curiosity, as these will guide you toward the right projects. Your excessive curiosity — even if it bores others — is the key to discovering your path.\n\nWhen you’re intensely interested in something, dive deep enough to reach the frontiers of knowledge where gaps and opportunities for discovery lie. Spotting these gaps takes skill, as our brains often overlook them for simplicity. Embrace unconventional ideas and boldly pursue outlier concepts that excite you, even if others ignore them. This process involves four steps: choose a field, learn extensively, notice gaps, and explore promising ones. Hard work is essential and driven by deep interest. The system assumes you'll magically guess your field early, but often, finding your path involves luck and curiosity-driven experimentation. By trying various things, meeting different people, and reading widely, you increase your chances of finding your passion. Optimize for what’s interesting to you, even if your interests seem unusual. Enjoying the tedious parts of a field is a good sign of suitability, but remain flexible and switch paths if you discover something more exciting along the way.\n\nIf you're creating something for people, make sure it's something they actually want by making something you, yourself, want. This aligns with the excitingness rule; the most thrilling story to write is the one you want to read. Many falter by aiming to please an imaginary, sophisticated audience instead of themselves. Several distractions—like pretentiousness, fashion, and money—can lead you astray, but genuine interest will keep you on track. This strategy requires boldness and a willingness to face rejection and failure, but not exhaustive planning. Great work often arises from hard work on ambitious projects rather than meticulous planning. Known as \"staying upwind,\" this approach involves doing whatever seems most interesting and offers the best future options at each stage. However, working on something exciting isn't always straightforward; it requires technique and perseverance, much like sailing through headwinds and hidden shoals.\n\nWorking too hard can lead to diminishing returns due to fatigue, reducing productivity and potentially harming your health. The optimal work period varies by task, with some requiring only four or five hours of concentrated effort, ideally uninterrupted. Arrange your schedule to allow large blocks of work time to avoid interruptions, which can deter starting hard tasks. Overcoming the initial resistance to begin work often requires psychologically tricking oneself, acknowledging that the mental threshold to start is higher than that to continue. Telling small lies to yourself, such as taking advantage of the \"How hard could it be?\" mindset, can catalyze project initiation, especially for younger, more optimistic individuals. Finish what you start, as significant progress often materializes in the final stages of a project. Additionally, considering your work exceedingly important can drive motivation and possibly lead to genuine significant discoveries.\n\nThere are two types of procrastination: per-day and per-project, with the latter being much more dangerous. Per-project procrastination involves delaying the start of ambitious projects because the timing never feels right, leading to years of inaction. This type of procrastination is particularly insidious because it camouflages itself as productivity; you're not idle, but diligently working on other tasks, and therefore, it doesn’t raise the same alarms as daily procrastination. To combat this, periodically ask yourself if you are working on what you truly want to work on. While it's acceptable for young people to occasionally say no, this becomes increasingly perilous with age. Achieving great work often requires dedicating an exceptional amount of time to a problem, which shouldn't be viewed as a cost but rather enjoyed as a compelling endeavor.\n\nGreat work isn't about slogging away at something you hate for years; it's about consistently dedicating yourself to something you're genuinely passionate about. The cumulative effect of consistent work can be astonishing—writing a mere page a day can result in a book a year. The key is consistency. Great achievements are often made by completing small tasks regularly, leading to exponential growth. This growth, though seemingly flat at first, soon accelerates, creating significant value over time. Whether it's learning or building an audience, the more you invest, the more you gain. Often, we underestimate this process and push through early stages unconsciously, realizing later the importance of initial efforts. Additionally, undirected thinking, such as when walking or showering, can spur innovative solutions, but it requires the foundation of deliberate work. Hence, a blend of persistent effort and occasional mind-wandering can lead to remarkable successes.\n\nAvoiding distractions at work is crucial, but it's equally important to avoid distractions during downtime that push your work out of focus. Letting your mind wander should center on what you care about most, except for love. Consciously develop your taste in work within your field; understanding the best and why it's the best will help you aim higher. Many agree that aiming to be the best rather than just good is essential, possibly because ambition often falls short of the target, or because striving for the best is a different, more motivating endeavor. Trying to be the best can be more liberating and simpler than just aiming to be good. Aim to create work that will be valued in a century, as this is a good proxy for genuine quality.\n\nDon't focus on crafting a distinctive style. Simply do your best; your unique style will emerge naturally. When you strive too hard for distinctiveness, it becomes artificial. True style flows effortlessly from your genuine efforts.\n\nAffectation involves adopting a fake persona, often showing in one's work, with the temptation being greater among the young due to feelings of insignificance. However, undertaking ambitious projects inherently solves this by establishing one's identity through achievement. While avoiding affectation is advisable, a more positive approach is to be earnest, which encompasses being intellectually honest and willing to admit mistakes, thereby avoiding similar vices. Earnestness also includes informality, focusing on substance over appearance, a trait often seen in nerds who conserve their energy for real work rather than pretense. Although cynicism and pessimism may be advantageous in some fields, optimism is essential for groundbreaking work, even at the risk of looking foolish. Great work necessitates earnestness, as it aligns consistently with both the creator and itself, often requiring a willingness to redo parts to maintain this consistency. To combat laziness and status quo bias, one should consider if, having made a change, reverting to the previous state would be desirable.\n\nHave the confidence to cut. Don't hold onto something that doesn't fit just because it makes you proud or because you put a ton of effort into it. In fact, in certain types of work, it's beneficial to strip down your project to its core. This will yield a more focused result, enhance your understanding, and prevent self-deception about the authenticity of your work.\n\nMathematical elegance might initially seem like a metaphor borrowed from the arts, as I once believed when I first encountered the term \"elegant\" for a proof. However, I've come to think it might actually be foundational — that artistic elegance derives from mathematical elegance. This notion of elegance extends beyond math, serving as a valuable standard in various fields. Elegance can be a long-term investment; while laborious solutions garner short-term prestige due to their complexity and the effort they demand, the finest work often appears effortless because it feels pre-existing, merely needing to be observed rather than constructed. The truest sign of brilliance in any creative endeavor is when it's unclear whether you're inventing something new or simply uncovering it.\n\nWhen you're involved in work that straddles the line between creation and discovery, lean towards discovery. Adopt the mindset of being a mere conduit through which ideas naturally take shape.\n\nChoosing a problem to work on is often viewed as a search but ideally resembles creating a new field during exploration. When building powerful tools, ensure they are unrestrictively designed, as they are likely to be used in unforeseen ways. Aim to create tools and ideas that others can build upon or answer questions with. The best ideas have wide-ranging implications and should be expressed in the most general form to reveal deeper truths. However, ideas must be both true and new, which requires a certain degree of skill to identify them once you reach the frontiers of knowledge.\n\nIn English, we attribute terms like originality, creativity, and imagination to a certain unique ability, which seems reasonable to label separately as it appears to be a distinct skill. One can possess substantial technical ability yet lack this creative flair. Personally, I dislike the term \"creative process,\" as originality seems more of a habitual mindset than a process. Original thinkers continuously generate new ideas on whatever they concentrate on, similar to an angle grinder producing sparks. However, if their focus is on something unfamiliar, the ideas may not be particularly good. For instance, an original thinker I know, post-divorce, shifted his focus to dating, an area he was inexperienced in, resulting in notably colorful outcomes. Observing originality dissociated from expertise highlights its true nature. While it's unclear if originality can be cultivated, there are definite ways to maximize it. You're more likely to have original ideas when engaged in challenging work, as these ideas arise from the efforts to build or understand something complex, not from trying to be original. Discussing or writing about interesting subjects can also spur new thoughts, as attempting to articulate ideas can draw out the missing pieces. Changing your context, such as traveling or even just taking a walk, can help dislodge new ideas. Exploring various topics expands the \"angle grinder's\" surface area and often yields fruitful analogies, but rather than spreading your attention thinly across many areas, focus deeply on a few and remain idly curious about others. Curiosity nurtures originality by providing new material to work with and is akin to what questions are to originality's answers. Often, generating new ideas means seeing what was always in plain sight, leading to the paradox that once an idea is found, it often seems obvious.\n\nWhen an idea strikes you as both novel and obvious at the same time, you can bet it's a good one.\n\nHaving new ideas is difficult because they often require a shift in perspective, which involves fixing broken models of the world. While our models help us, they also constrain us, making it hard to notice and correct their flaws. Once a broken model is fixed, new ideas become obvious, illustrating why they seem easy yet hard to discover. Being stricter than others can help identify broken models, as they leave clues against reality that most people ignore. Einstein's success in recognizing the implications of Maxwell's equations stemmed from his stricter view. Moreover, a willingness to break rules is essential for creating new models, as truly innovative ideas break implicit rules of old models and appear conservative only after they succeed. The heliocentric model took a century to be accepted because it initially felt wrong. Thus, good new ideas often seem bad initially; what you seek are ideas that are crazy in a way that is exciting and rich in implications. Recognizing them is uncertain since bad ideas can also seem crazy. Comfort with rule-breaking, whether enjoyed or disregarded, is crucial. Aggressively independent-minded people, who derive energy from breaking rules, find delight in the audacity of their projects, which helps them get started.\n\nThe other way to break rules is simply not to care about them or even know they exist, which is why novices and outsiders often make new discoveries; their ignorance of a field's assumptions brings a form of passive independent-mindedness. Similarly, people on the autism spectrum (Aspies) seem to possess an immunity to conventional beliefs, aiding them in generating new ideas. While popular culture pits strictness against rule-breaking, this is a flawed perspective, especially in significant matters where only rule-breakers can truly be stringent. Often, overlooked ideas are subconsciously dismissed because they seem too weird, risky, labor-intensive, or controversial. This opens up an intriguing possibility: if you could disable these filters, you'd see more innovative ideas. One way to achieve this is by considering what ideas might be valuable for others to explore, thereby circumventing your subconscious self-censorship.\n\nYou can uncover hidden ideas by examining what's obscuring them, particularly by challenging cherished but mistaken principles, which often create a dead zone of unexplored, valuable ideas. Religions exemplify such collections of flawed principles, meaning that anything metaphorically or literally resembling a religion will have untapped potential hidden in its shadow. Notable figures like Copernicus and Darwin made significant discoveries by confronting such prevailing beliefs. Reflect on what your field might be religious about—principles taken as self-evident but which may not be—and consider the possibilities that arise if you discard these assumptions. Interestingly, people show more originality in solving problems than in choosing which problems to tackle, with even the brightest minds often conservatively sticking to fashionable problems rather than exploring uncharted territory.\n\nPeople tend to be more conservative when choosing problems to tackle rather than solutions because problems can be long-term commitments, occupying years, while solutions might only take days to explore. Yet this conservatism often goes too far, influenced by both risk aversion and fashion trends, undervaluing unfashionable problems. Some of the most rewarding work comes from revisiting problems deemed fully explored but rich with latent potential, as Durer and Watt demonstrated. Working on unfashionable problems can be gratifying, free from hype and scrutiny, and involves developing ideas that would otherwise be wasted. The most overlooked problems, however, aren't necessarily unfashionable but are underrated in importance. Finding such problems requires indulging your curiosity and setting aside the urge to only pursue \"important\" problems. The key to groundbreaking work lies in the originality of the problems you choose, as this often leads to discovering new fields. The ratio of question to answer in big ideas is misunderstood; the real insight frequently lies in the question itself.\n\nPart of the reason we undervalue questions is their fleeting nature in schools, where they are answered quickly, much like unstable particles. However, truly great questions can be more than this—they are partial discoveries. They propel us into uncharted territory: How do new species arise? Is the force that pulls objects to the Earth the same as the one that keeps planets in orbit? Unanswered questions can be uncomfortable, but carrying them increases the likelihood of finding solutions or recognizing connections between them. Sometimes, these questions linger with us for years, even from childhood, driving significant discoveries. While people often emphasize the importance of maintaining youthful dreams, it's equally crucial to keep our youthful questions alive.\n\nExperts aren't always certain; in fact, being puzzled about important, unexplored questions often leads to originality. Embrace puzzlement and be rich in unanswered questions, as exploring them generates even more inquiries. Rather than demanding grand questions, pull on the threads of curiosity and see what unravels. Small, prolific efforts often lead to big discoveries, though they come with failures. Favor starting small and evolving projects through successive versions, especially when creating for others, rather than over-planning. Take risks, as high rewards come from them, and avoid the conservatism that often accompanies inexperience.\n\nEven a project that fails can hold immense value. Through the process, you get to explore uncharted territory and confront unique questions that others may not have even considered. There's no richer source of questions than those you come across by attempting something that’s just beyond your reach.\n\nUse the advantages of youth—energy, time, optimism, and freedom—and those of age—knowledge, efficiency, money, and power—appropriately as you encounter them in life. While young, take advantage of your abundant time by engaging in slightly frivolous activities, experimenting, and exploring new interests. This approach allows learning through experience and fresh perspectives, sometimes discovering flaws in ideas that others ignore. As you grow older, discern what truly matters and eliminate insignificant concerns, focusing on impactful activities. Schools often foster passivity and limited views of learning, so dynamically engage with education. Rather than copying uncritically, leverage others' ideas openly and adapt them to create meaningful, original work. Recognize that even successful people have flaws and learn vicariously through both positive and negative examples. Embrace cross-field ideas and visit hubs of excellence for inspiration and self-belief. This balanced approach, from youth to age, can enrich your growth and achievements.\n\nIf you're genuinely interested, you'll likely receive a warmer welcome than anticipated from experts in any field, as they often enjoy discussing their work with earnest individuals. Outstanding professionals typically have a passionate, hobbyist-like dedication to their work, and finding such colleagues, though sometimes difficult due to the prestige associated with great work, is crucial. Universities, for instance, maintain a polite fiction that everyone produces high-quality work, though the reality varies greatly across departments. Seek out the best colleagues as their influence is crucial; they can offer fresh insights and support that can elevate your own work. Working with excellent colleagues is better than having many decent ones, as seen in historical clusters of greatness. You'll know you have good colleagues when they continuously surprise and challenge you. While everyone can benefit from collaboration, some projects require large-scale teamwork and effective management, which demands specific skills and dedication. If managing isn't your forte, you must either learn it or avoid such projects. Lastly, maintaining your morale is vital when working on ambitious endeavors, so nurture and protect it diligently.\n\nMorale begins with your perspective on life. An optimistic outlook helps you produce great work, and considering yourself fortunate rather than a victim boosts your likelihood of success.\n\nIndeed, work can offer a refuge from your problems. Engaging in pure work's intrinsic difficulties can be a productive form of escapism, as evidenced by some of the greatest minds in history. High morale fosters good work, which in turn boosts morale, creating a positive cycle. Conversely, poor work can demoralize, making the cycle spiral downward. Therefore, when stuck, switching to easier tasks can help maintain productivity and morale. A critical mistake ambitious individuals make is allowing setbacks to shatter their morale. To avoid this, consider setbacks as integral to the process. Tackling hard problems often requires backtracking. Hence, \"If at first you don't succeed, try, try again\" should be refined to: If at first you don't succeed, either try again or backtrack and then try again.\n\n\"Never give up\" misses the mark slightly. Sometimes, ejecting is the right move. A more accurate motto would be: Never let setbacks make you backtrack more than necessary. And importantly: Never abandon the root node. Struggling doesn't inherently mean you're off course—think of it like being out of breath while running; it all depends on your speed. So, learn to tell the difference between good pain and bad pain. Good pain signifies effort, while bad pain indicates damage.\n\nAn audience is crucial for maintaining morale. Whether you're a scholar sharing your work with peers or an artist performing for an audience in the traditional sense, the size of your audience isn't as important as its quality. This is particularly uplifting for those just starting out since a small, dedicated audience can be immensely sustaining. Even if only a handful of people genuinely love what you do, that's sufficient. Whenever possible, try to bypass intermediaries between you and your audience. While this may not always be achievable in some fields, the liberation of directly connecting with your audience may be worth considering a switch to a related field where direct engagement is feasible. \n\n[28]\n\nThe people you spend time with will significantly impact your morale. Some individuals will increase your energy, while others will decrease it, and these effects can often be surprising. Make it a point to seek out those who boost your energy and steer clear of those who sap it. However, if caring for someone is necessary, that responsibility should take precedence.\n\nDon't marry someone who sees your work as competition for your attention. If you're ambitious, working is essential—almost like a medical necessity. If your partner prevents you from working, they either don't understand you or don't care. Remember, morale is physical; you think with your body. Therefore, maintain a healthy lifestyle by exercising regularly, eating and sleeping well, and avoiding dangerous drugs. Running and walking are great forms of exercise because they're good for thinking. Achievers aren't necessarily happier, but they're happier than they'd be if unproductive. Ambitious, intelligent folks who don't achieve can become bitter. It's okay to want to impress others, but focus on those you genuinely respect. Fame, or the approval of a larger, less significant group, is just noise.\n\nThe prestige of a type of work is often an afterthought and can sometimes be entirely wrong. If you excel at something, you'll make it prestigious. The essential question is not how prestigious a type of work is, but how well it can be done. While competition can motivate, don't let it dictate your choices; avoid pursuing something merely because others are. Let your curiosity be your guide—it never misleads and inherently knows what's worth your focus. Pursue what genuinely intrigues you, and you'll find your own path to success.\n\nIf you asked an oracle the secret to doing great work, my bet would be on \"curiosity.\" Curiosity alone isn’t enough and you can't force it, but you can nurture it. It's essential across all four steps of doing great work: it guides you to a field, drives you to its frontier, highlights gaps, and compels you to explore them. This essay is long, partly to act as a filter; if you're still reading, you’re inherently interested in doing great work. This boils down to ability and interest, with effort assumed and luck disregarded as uncontrollable. Can you find work where your ability and interest spark new ideas? Likely, yes. The key challenge is finding that work and letting curiosity guide you. Many shy away from pursuing greatness, fearing failure and seeming presumptuous. Yet, are you willing to strive for great work? Now you're consciously deciding. Don’t worry about failing or seeming presumptuous; many face worse problems. Aim for greatness, and let curiosity drive you.\n\nYes, you'll have to work hard. But remember, lots of people have to work hard. If you're pursuing something fascinating, which you naturally will be if you're on the right path, the work will likely feel less burdensome than it does for many of your peers. The discoveries are out there, just waiting to be made. So, why not by you?","Driven by curiosity about common strategies for achieving great work across fields, I created a guide applicable to anyone. Central to it is the notion that highly ambitious individuals should choose work aligned with their natural talents, deep interests, and has the potential for outstanding output. Often, discovering your path involves trial and error, propelled by curiosity and self-driven projects. This process involves selecting a field, extensive learning, identifying knowledge gaps, and exploring them. Consistent deep interest fuels hard work, and success often stems from the cumulative effect of consistent small tasks. It's crucial to focus without distractions, allowing occasional mind-wandering for innovation. Cultivate a refined taste in your work, aiming to be the best. Authenticity is vital; true style emerges from genuine efforts rather than affectation. Optimism is essential for groundbreaking work, which requires earnestness, intellectual honesty, and a focus on substance. Great work also demands confidence to discard inauthentic parts and a drive towards elegance, where the finest, most brilliant work feels pre-existing rather than constructed.\n\nWhen engaging in work that blends creation and discovery, prioritize discovery by viewing yourself as a conduit for ideas to naturally emerge. Rather than merely searching for a problem to solve, consider it an exploration to create entirely new fields. Design powerful tools with flexibility in mind, anticipating unforeseen uses. Strive to generate tools and ideas that others can expand upon or use to answer questions. The most impactful ideas have broad implications and should be articulated in general terms to uncover deeper truths. Importantly, these ideas must be both true and novel, a skill that becomes critical as you approach the boundaries of knowledge.\n\nIn English, terms like originality, creativity, and imagination denote a unique ability that seems distinct from technical skills alone. I personally find the term \"creative process\" inadequate because originality feels more like a habitual mindset. Original thinkers habitually generate fresh ideas in their focus areas, much like sparks from an angle grinder. However, their unfamiliarity with a topic can result in less effective ideas, highlighting originality as separate from expertise. Originality thrives in challenging work environments and often emerges from efforts to build or understand complex subjects, rather than from attempting to be original. Engaging in stimulating discussions, changing your context, and exploring varied topics can also foster originality. Notably, originality often involves recognizing obvious yet overlooked solutions that require challenging existing models. Rule-breaking and independent thinking, seen in historic figures like Einstein, are crucial for creating innovative models. People tend to be more conservative in choosing problems rather than solutions, often missing out on underrated yet significant issues. Groundbreaking work stems from the originality of chosen problems, often leading to new fields of inquiry. Embrace puzzlement and unanswered questions, as they drive discovery. Start small, take risks, and evolve projects through successive versions. Use the advantages of youth, such as energy and optimism, and the advantages of age, like knowledge and efficiency, as they come. Engage dynamically with education and leverage others' ideas to create original work. Successful collaboration and excellent colleagues are invaluable, as seen in historical clusters of greatness. Maintaining morale and an optimistic outlook is vital for ambitious endeavors.uccess.\n\nWork can serve as a productive escape from life's problems, with its intrinsic challenges providing a constructive form of diversion. High morale leads to good work, creating a cyclical boost, whereas poor work can spiral morale downward. To stay productive, switching to easier tasks when stuck can help. Ambitious individuals often make the mistake of letting setbacks demoralize them, but setbacks are part of the process. The adage \"If at first you don't succeed, try, try again\" should be nuanced to include backtracking when necessary. Rather than stubbornly pushing forward, it's often wise to reassess and adjust. Persist, but don’t overdo backtracking; never abandon your core mission. Distinguishing between good pain (indicative of effort) and bad pain (indicative of damage) is crucial in assessing progress. A quality audience is vital for morale, whether you’re a scholar or an artist. The size of the audience is less important than its quality; even a small, devoted audience can be highly sustaining. Direct engagement with your audience is invaluable, and where possible, circumventing intermediaries can enhance this connection, potentially warranting a shift to a field where direct engagement is feasible.\n\nThe individuals you surround yourself with can drastically affect your morale. Some people will uplift and energize you, while others may drain your spirit, often in surprising ways. Make a conscious effort to seek out those who enhance your energy and avoid those who deplete it. Yet, if you have a responsibility to care for someone, that duty should always come first.\n\nDon't marry someone who views your work as a rival for your attention. Your ambition and work are vital, almost like a medical necessity. If your partner obstructs your work, they either don't understand or don't care. Morale is physical; you think with your body, so maintain a healthy lifestyle by exercising, eating, and sleeping well. Running and walking are excellent for thinking. Achievers might not be the happiest, but they're happier than if they were unproductive. Ambitious, intelligent people who don't achieve can become bitter. Wanting to impress others is fine, but focus on those you genuinely respect. Fame is just noise; the true value lies in how well you can do the work. Let curiosity guide you—it knows what's truly worth your focus. Curiosity isn't everything, but you can nurture it, and it's essential in all steps of doing great work. If you're still reading, you're interested in great work. The question is whether you find work where your ability and interest spark new ideas. Don't fear failure or appearing presumptuous; aim for greatness and let curiosity drive you. Yes, it'll be hard work, but if you're on the right path, it will feel less burdensome. The discoveries are out there, waiting to be made—why not by you?","demo/paul_graham/great_work"],"uses":{}}]}
